package core_06;

/**
 * Created by aBulgakoff on 6/20/16.
 */
public class TextOfAssignment {
    /**
     *
     Добавить в магазин инструментов метод, который готовит к отгрузке партию музыкальных инструментов
     согласно заказу.

     Сигнатура метода:
     public List<String> prepareInstruments(Map<String, Integer> order){...}
     В заказе (Map<String, Integer> order) хранится название инструмента и количество необходимых инструментов.
     Ключем в заказе является одна из строк "piano", "guitar", "trumpet"

     Создать свое исключение, которое будет брошено в случае, когда ключ в заказе другой.
     Каким-то образом (самостоятельно выбрать решение) обработать ситуацию,
     когда количество элементов в заказе отрицательное, нулевое.

     После выполнения метода из магазина должны пропасть те инструменты, которые были отгружены.
     В случае, когда количество запрашиваемых инструментов определенного типа больше,
     чем количество доступных инструментов в магазине, должно быть брошено исключение.
     Выбрать наиболее подходящее из доступных в стандартной библиотеке исключений

     Создать класс, который печатает созданные коллекции на экран в виде таблицы.
     Создать упорядоченный список не прибегая к использованию Collections.sort().

     */
}
